app/controllers/payment_profiles_controller.rb

SELECT  "payment_profiles".* FROM "payment_profiles" WHERE "payment_profiles"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."user_id" = ? AND "subscriptions"."stripe_id" = ? LIMIT ?  [["user_id", 1], ["stripe_id", "sub_97dVJEQMidBm7p"], ["LIMIT", 1]]
SELECT  "plans".* FROM "plans" WHERE "plans"."stripe_id" = ? LIMIT ?  [["stripe_id", "starter_plan"], ["LIMIT", 1]]
---
  def edit
    authorize @payment_profile

    customer = FetchStripeCustomer.call(@payment_profile.user)
    if @payment_profile.user.payment_profile.errors.any?
      render 'edit'
      return
    end

    # Sync Plan With Stripe
    customer.subscriptions.each do |s|
      sub = current_user.subscriptions.find_by_stripe_id(s.id)
      plan = Plan.find_by_stripe_id(s.plan.id)

SELECT  "payment_profiles".* FROM "payment_profiles" WHERE "payment_profiles"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def add_card
    authorize @payment_profile

    stripe_customer = FetchStripeCustomer.call(@payment_profile.user)
    if @payment_profile.user.payment_profile.errors.any?

SELECT  "payment_profiles".* FROM "payment_profiles" WHERE "payment_profiles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_payment_profile
      @payment_profile = PaymentProfile.find(params[:id])